CityData = [
    {
        id: "北京", 
        province: "北京", 
        lat: 39.9031324643, 
        lon: 116.4010433787
    }, 
    {
        id: "天津", 
        province: "天津", 
        lat: 39.0867706952, 
        lon: 117.196953841
    }, 
    {
        id: "重庆", 
        province: "重庆", 
        lat: 29.565545745, 
        lon: 106.5483098308
    }, 
    {
        id: "上海", 
        province: "上海", 
        lat: 31.2319526784, 
        lon: 121.469443249
    }, 
    {
        id: "石家庄", 
        province: "河北", 
        lat: 38.0417654681, 
        lon: 114.5087442984
    }, 
    {
        id: "沈阳", 
        province: "辽宁", 
        lat: 41.8025810937, 
        lon: 123.4244498695
    }, 
    {
        id: "哈尔滨", 
        province: "黑龙江", 
        lat: 45.8012488452, 
        lon: 126.528844686
    }, 
    {
        id: "杭州", 
        province: "浙江", 
        lat: 30.2753694112, 
        lon: 120.1509063337
    }, 
    {
        id: "福州", 
        province: "福建", 
        lat: 26.0772916987, 
        lon: 119.2921461622
    }, 
    {
        id: "济南", 
        province: "山东", 
        lat: 36.6498157915, 
        lon: 117.1140788117
    }, 
    {
        id: "广州", 
        province: "广东", 
        lat: 23.1317146641, 
        lon: 113.2595185241
    }, 
    {
        id: "武汉", 
        province: "湖北", 
        lat: 30.5952548577, 
        lon: 114.2999398195
    }, 
    {
        id: "成都", 
        province: "四川", 
        lat: 30.6522796787, 
        lon: 104.0725574128
    }, 
    {
        id: "昆明", 
        province: "云南", 
        lat: 25.0482091732, 
        lon: 102.7083355915
    }, 
    {
        id: "兰州", 
        province: "甘肃", 
        lat: 36.0615359884, 
        lon: 103.831940499
    }, 
    {
        id: "台北", 
        province: "台湾", 
        lat: 25.03746, 
        lon: 121.564558
    }, 
    {
        id: "南宁", 
        province: "广西", 
        lat: 22.8189749942, 
        lon: 108.3625136575
    }, 
    {
        id: "银川", 
        province: "宁夏", 
        lat: 38.4861080644, 
        lon: 106.2280245534
    }, 
    {
        id: "太原", 
        province: "山西", 
        lat: 37.8701144671, 
        lon: 112.5436500641
    }, 
    {
        id: "长春", 
        province: "吉林", 
        lat: 43.8137766729, 
        lon: 125.3171698527
    }, 
    {
        id: "南京", 
        province: "江苏", 
        lat: 32.0604117958, 
        lon: 118.7911366424
    }, 
    {
        id: "合肥", 
        province: "安徽", 
        lat: 31.8223533535, 
        lon: 117.2216698776
    }, 
    {
        id: "南昌", 
        province: "江西", 
        lat: 28.6870805012, 
        lon: 115.8535540365
    }, 
    {
        id: "郑州", 
        province: "河南", 
        lat: 34.7483926297, 
        lon: 113.6192610688
    }, 
    {
        id: "长沙", 
        province: "湖南", 
        lat: 28.2322704791, 
        lon: 112.9335552442
    }, 
    {
        id: "海口", 
        province: "海南", 
        lat: 20.0403154771, 
        lon: 110.31432196
    }, 
    {
        id: "贵阳", 
        province: "贵州", 
        lat: 26.6511980693, 
        lon: 106.6267636888
    }, 
    {
        id: "西安", 
        province: "陕西", 
        lat: 34.3425923471, 
        lon: 108.9349972803
    }, 
    {
        id: "西宁", 
        province: "青海", 
        lat: 36.6171840345, 
        lon: 101.7758011664
    }, 
    {
        id: "呼和浩特", 
        province: "内蒙古", 
        lat: 40.8410664107, 
        lon: 111.7418112118
    }, 
    {
        id: "拉萨", 
        province: "西藏", 
        lat: 29.6467182663, 
        lon: 91.1127022311
    }, 
    {
        id: "乌鲁木齐", 
        province: "新疆", 
        lat: 43.8232927607, 
        lon: 87.6151718524
    }
]